{"format": "layers-model", "generatedBy": "keras v3.6.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.6.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, null], "dtype": "float32", "sparse": false, "name": "encoder_input"}, "name": "encoder_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_shape": [null, null], "dtype": "float32", "sparse": false, "name": "decoder_input"}, "name": "decoder_input", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "encoder_embedding", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "input_dim": 344, "output_dim": 100, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false}, "name": "encoder_embedding", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null], "dtype": "float32", "keras_history": ["encoder_input", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Embedding", "config": {"name": "decoder_embedding", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "input_dim": 344, "output_dim": 100, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false}, "name": "decoder_embedding", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null], "dtype": "float32", "keras_history": ["decoder_input", 0, 0]}}], "kwargs": {}}]}, {"class_name": "GRU", "config": {"name": "enc_gru1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 688, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "OrthogonalInitializer", "config": {"seed": null, "gain": 1.0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "reset_after": true, "seed": null}, "name": "enc_gru1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null, 100], "dtype": "float32", "keras_history": ["encoder_embedding", 0, 0]}}], "kwargs": {"training": false, "mask": null}}]}, {"class_name": "GRU", "config": {"name": "dec_gru1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 688, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "OrthogonalInitializer", "config": {"seed": null, "gain": 1.0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "reset_after": true, "seed": null}, "name": "dec_gru1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null, 100], "dtype": "float32", "keras_history": ["decoder_embedding", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 688], "dtype": "float32", "keras_history": ["enc_gru1", 0, 1]}}], "kwargs": {"training": false}}]}, {"class_name": "GRU", "config": {"name": "enc_gru2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 688, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "OrthogonalInitializer", "config": {"seed": null, "gain": 1.0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "reset_after": true, "seed": null}, "name": "enc_gru2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null, 688], "dtype": "float32", "keras_history": ["enc_gru1", 0, 0]}}], "kwargs": {"training": false, "mask": null}}]}, {"class_name": "GRU", "config": {"name": "dec_gru2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 688, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "OrthogonalInitializer", "config": {"seed": null, "gain": 1.0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "reset_after": true, "seed": null}, "name": "dec_gru2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null, 688], "dtype": "float32", "keras_history": ["dec_gru1", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 688], "dtype": "float32", "keras_history": ["enc_gru2", 0, 1]}}], "kwargs": {"training": false}}]}, {"class_name": "Dense", "config": {"name": "decoder_output", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 344, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "decoder_output", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null, 688], "dtype": "float32", "keras_history": ["dec_gru2", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["encoder_input", 0, 0], ["decoder_input", 0, 0]], "output_layers": [["decoder_output", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of9.bin", "group1-shard2of9.bin", "group1-shard3of9.bin", "group1-shard4of9.bin", "group1-shard5of9.bin", "group1-shard6of9.bin", "group1-shard7of9.bin", "group1-shard8of9.bin", "group1-shard9of9.bin"], "weights": [{"name": "dec_gru1/gru_cell/kernel", "shape": [100, 2064], "dtype": "float32"}, {"name": "dec_gru1/gru_cell/recurrent_kernel", "shape": [688, 2064], "dtype": "float32"}, {"name": "dec_gru1/gru_cell/bias", "shape": [2, 2064], "dtype": "float32"}, {"name": "dec_gru2/gru_cell/kernel", "shape": [688, 2064], "dtype": "float32"}, {"name": "dec_gru2/gru_cell/recurrent_kernel", "shape": [688, 2064], "dtype": "float32"}, {"name": "dec_gru2/gru_cell/bias", "shape": [2, 2064], "dtype": "float32"}, {"name": "decoder_embedding/embeddings", "shape": [344, 100], "dtype": "float32"}, {"name": "decoder_output/kernel", "shape": [688, 344], "dtype": "float32"}, {"name": "decoder_output/bias", "shape": [344], "dtype": "float32"}, {"name": "enc_gru1/gru_cell/kernel", "shape": [100, 2064], "dtype": "float32"}, {"name": "enc_gru1/gru_cell/recurrent_kernel", "shape": [688, 2064], "dtype": "float32"}, {"name": "enc_gru1/gru_cell/bias", "shape": [2, 2064], "dtype": "float32"}, {"name": "enc_gru2/gru_cell/kernel", "shape": [688, 2064], "dtype": "float32"}, {"name": "enc_gru2/gru_cell/recurrent_kernel", "shape": [688, 2064], "dtype": "float32"}, {"name": "enc_gru2/gru_cell/bias", "shape": [2, 2064], "dtype": "float32"}, {"name": "encoder_embedding/embeddings", "shape": [344, 100], "dtype": "float32"}]}]}